bench/xmin-horizon/results/s2-pgque/producer.log
pgbench (18.3, server 17.9 (Debian 17.9-1.pgdg13+1))
starting vacuum...pgbench: error: ERROR:  relation "pgbench_branches" does not exist
pgbench: detail: (ignoring this error and continuing anyway)
pgbench: error: ERROR:  relation "pgbench_tellers" does not exist
pgbench: detail: (ignoring this error and continuing anyway)
pgbench: error: ERROR:  relation "pgbench_history" does not exist
pgbench: detail: (ignoring this error and continuing anyway)
end.
progress: 5.0 s, 780.2 tps, lat 1.172 ms stddev 0.781, 0 failed, lag 0.487 ms
progress: 10.0 s, 817.6 tps, lat 1.196 ms stddev 0.783, 0 failed, lag 0.486 ms
progress: 15.0 s, 807.0 tps, lat 1.521 ms stddev 0.922, 0 failed, lag 0.538 ms
progress: 20.0 s, 801.8 tps, lat 2.234 ms stddev 4.497, 0 failed, lag 1.095 ms
progress: 25.0 s, 796.2 tps, lat 1.632 ms stddev 1.003, 0 failed, lag 0.598 ms
progress: 30.0 s, 795.4 tps, lat 1.685 ms stddev 1.769, 0 failed, lag 0.650 ms
progress: 35.0 s, 802.2 tps, lat 2.042 ms stddev 3.487, 0 failed, lag 0.919 ms
progress: 40.0 s, 801.8 tps, lat 2.928 ms stddev 7.173, 0 failed, lag 1.631 ms
progress: 45.0 s, 785.0 tps, lat 3.192 ms stddev 9.642, 0 failed, lag 2.030 ms
progress: 50.0 s, 807.0 tps, lat 1.913 ms stddev 1.708, 0 failed, lag 0.715 ms
progress: 55.0 s, 785.2 tps, lat 1.673 ms stddev 0.819, 0 failed, lag 0.548 ms
progress: 60.0 s, 801.4 tps, lat 2.112 ms stddev 1.693, 0 failed, lag 0.766 ms
progress: 65.0 s, 807.0 tps, lat 2.256 ms stddev 1.866, 0 failed, lag 0.842 ms
progress: 70.0 s, 794.0 tps, lat 1.914 ms stddev 0.973, 0 failed, lag 0.631 ms
progress: 75.0 s, 809.0 tps, lat 1.887 ms stddev 0.849, 0 failed, lag 0.615 ms
progress: 80.0 s, 804.6 tps, lat 2.073 ms stddev 1.276, 0 failed, lag 0.717 ms
progress: 85.0 s, 814.0 tps, lat 3.582 ms stddev 8.761, 0 failed, lag 2.063 ms
progress: 90.0 s, 799.9 tps, lat 2.193 ms stddev 1.122, 0 failed, lag 0.731 ms
progress: 95.0 s, 821.3 tps, lat 2.201 ms stddev 1.214, 0 failed, lag 0.751 ms
progress: 100.0 s, 791.2 tps, lat 3.082 ms stddev 2.940, 0 failed, lag 1.242 ms
progress: 105.0 s, 789.0 tps, lat 2.491 ms stddev 1.340, 0 failed, lag 0.848 ms
progress: 110.0 s, 824.4 tps, lat 2.949 ms stddev 1.972, 0 failed, lag 1.085 ms
progress: 115.0 s, 792.2 tps, lat 2.712 ms stddev 1.582, 0 failed, lag 0.956 ms
progress: 120.0 s, 783.2 tps, lat 3.654 ms stddev 5.311, 0 failed, lag 1.699 ms
progress: 125.0 s, 808.2 tps, lat 3.457 ms stddev 2.604, 0 failed, lag 1.410 ms
progress: 130.0 s, 808.0 tps, lat 4.338 ms stddev 3.569, 0 failed, lag 1.973 ms
progress: 135.0 s, 803.2 tps, lat 3.625 ms stddev 2.532, 0 failed, lag 1.500 ms
progress: 140.0 s, 805.2 tps, lat 3.415 ms stddev 2.656, 0 failed, lag 1.370 ms
progress: 145.0 s, 803.4 tps, lat 3.413 ms stddev 2.072, 0 failed, lag 1.271 ms
progress: 150.0 s, 794.2 tps, lat 4.143 ms stddev 4.004, 0 failed, lag 1.878 ms
progress: 155.0 s, 783.6 tps, lat 3.368 ms stddev 1.725, 0 failed, lag 1.230 ms
progress: 160.0 s, 800.3 tps, lat 8.467 ms stddev 14.634, 0 failed, lag 5.761 ms
progress: 165.0 s, 785.7 tps, lat 4.846 ms stddev 4.286, 0 failed, lag 2.314 ms
progress: 170.0 s, 826.0 tps, lat 4.660 ms stddev 3.370, 0 failed, lag 2.132 ms
progress: 175.0 s, 789.8 tps, lat 4.075 ms stddev 2.554, 0 failed, lag 1.708 ms
progress: 180.0 s, 784.4 tps, lat 4.481 ms stddev 3.223, 0 failed, lag 1.940 ms
transaction type: /Users/nik/github/pgque/.claude/worktrees/agent-a48559ba7fdb1315c/bench/xmin-horizon/scripts/pgque-producer.bench
scaling factor: 1
query mode: simple
number of clients: 4
number of threads: 4
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 144019
number of failed transactions: 0 (0.000%)
latency average = 2.960 ms
latency stddev = 4.424 ms
rate limit schedule lag: avg 1.309 (max 108.576) ms
initial connection time = 20.632 ms
tps = 800.164710 (without initial connection time)